Repository: repupress/onpage-post-seo-wordpress-plugin
Catalog: languages/wtb_seo-*.po
Languages: de_de

source: OnPage Post SEO Settings
de_de: OnPage Post SEO Einstellungen

source: On-Page and Post Options
de_de: SEO post optimizer Optionen

source: Ideal keyword density (default: 3%)
de_de: Optimale Keyword Dichte (Standard: 3%)

source: Ideal post lenght (default: 250)
de_de: Optimale Länge des Textes (Standard: 250 Wörter)

source: Parameter to check
de_de: Optionen zur Überprüfung

source: Keyword density or WDF to show
de_de: Einstellung Keywordedichte oder WDF

source: Activate in custom post types
de_de: Das Plugin soll in folgenden Beitragsarten aktiv sein

source: Custom post types
de_de: Beitragsarten

source: WooCommerce settings
de_de: WooCommerce Einstellungen

source: Check short description
de_de: Check kurz Beschreibung

source: Auto refresh settings
de_de: Autorefresh Einstellungen

source: Disabled
de_de: Deaktivieren

source: Auto refresh after (sec.)
de_de: Autorefresh nach (Sek.)

source: You do not have sufficient permissions to access this page.
de_de: Sie haben nicht die erforderlichen Rechte, um diese Seite anzuzeigen

source: words
de_de: Wörter

source: H1 tag
de_de: H1 Überschrift

source: H2 tag
de_de: H2 Überschrift

source: H3 tag
de_de: H3 Überschrift

source: bold
de_de: fett

source: italicize
de_de: kursiv

source: underline
de_de: unterstrichen

source: picture
de_de: Bild

source: You do not have an image to add ALT tags
de_de: Kein Bild vorhanden, um einen ALT tag zu vergeben

source: You have an image to add ALT tags to
de_de: Bild vorhanden zur Vergabe eines ALT Tags

source: The text is not long enough. Please write %s words more.
de_de: Der Text ist nicht lang genug. Bitte schreiben Sie %s Wörter mehr

source: The text is long enough
de_de: Der Text ist lang genug.

source: Internal Links are missing
de_de: Interne Links fehlen.

source: Internal Links are here
de_de: Interne Links sind vorhanden.

source: You have too many H1 tags
de_de: Zu viele H1 tags vorhanden

source: You have no H1 tag
de_de: Kein H1 tag vorhanden

source: You have one H1 tag
de_de: Ein H1 tag vorhanden

source: You have too many H2 tags
de_de: Zu viele H2 tags vorhanden

source: You dont have H2 tags
de_de: Keine H2 tags vorhanden

source: You have enough H2 tags
de_de: Ausreichend H2 tags vorhanden

source: You dont have H3 tags
de_de: Keine H3 tags vorhanden

source: You have too many H3 tags
de_de: Zu viele H3 tags vorhanden

source: You have enough H3 tags
de_de: Ausreichend H3 tags vorhanden

source: It’s adjuvant to have an image in your post or on your page. It’s useful for visitors and increases your chance to be found in Google images.
de_de: Es ist hilfreich, ein Bild im Beitrag zu verwenden. Es ist für Besucher nützlich und verbessert die Chance, über google images gefunden zu werden.

source: Search engines prefer text with a minimum length of 250 words.
de_de: Suchmaschinen bevorzugen Text mit einer Länge von mind. 250 Wörtern.

source: Use internal links to older content with similar subject on your domain, to optimize your internal structure.
de_de: Verwenden Sie interne Links zu älteren Inhalten mit ähnlichem Thema um die interne Linkstruktur zu verbessern.

source: Search engines expect exact one H1 tag on each page. There should be only one H1 tag on each page, but there should be one!
de_de: Suchmaschinen erwarten genau ein H1 tag auf jeder Seite. Es sollte nur ein H1 tag auf jeder Seite vorhanden sein, es darf aber auch nicht fehlen.

source: You should use H2 tags in your post or on your page to help search engines crawling your page. Use one or two H2 tags for optimum.
de_de: Sie sollten H2 tags benutzen, um Suchmaschinen die Indexierung der Seite zu erleichtern. Optimal sind ein bis zwei H2 tags.

source: You should use H3 tags on your page. Use up to four H3 tags on one page.
de_de: Sie sollten H3 tags benutzen, um Suchmaschinen die Indexierung der Seite zu erleichtern. Optimal sind bis zu vier H3 tags auf einer Seite.

source: There is no keyword in title
de_de: Kein Keyword im Title des Beitrages

source: There is keyword in title
de_de: Keyword im Title vorhanden

source: You do not have an H1 tag containing your keyword
de_de: Kein H1 tag vorhanden, der das Keyword enthält

source: You have an H1 tag containing your keyword
de_de: Ein H1 tag vorhanden, der das Keyword enthält

source: You do not have an H2 tag containing your keyword
de_de: Kein H2 tag vorhanden, der das Keyword enthält

source: You have an H2 tag containing your keyword
de_de: Ein H2 tag vorhanden, der das Keyword enthält

source: You do not have an H3 tag containing your keyword
de_de: Kein H3 tag vorhanden, der das Keyword enthält

source: You have an H3 tag containing your keyword
de_de: Ein H3 tag vorhanden, der das Keyword enthält

source: Your keyword is not in bold
de_de: Kein Keyword in fett/bold vorhanden

source: Your keyword is in bold
de_de: Keyword in fett/bold vorhanden

source: Your keyword is not italicized
de_de: Keyword in kursiv nicht vorhanden

source: Your keyword is italicized
de_de: Keyword in kursiv vorhanden

source: Your keyword is not underlined
de_de: Keyword unterstrichen nicht vorhanden

source: Your keyword is in underline
de_de: Keyword unterstrichen vorhanden

source: Your keyword is not in image alt tag
de_de: Keyword nicht im alt tag des Bildes vorhanden

source: Your keyword is in image alt tag
de_de: Keyword im alt tag des Bildes vorhanden

source: For good rankings, your keyword should also be in the title of your page or your post.
de_de: Für gute Platzierungsergebnisse in den Suchmaschinen sollte ddas Keyword auch im Title des Beitrages erscheinen

source: For good rankings there should be a H1 tag containing the Keyword.
de_de: Für gute Platzierungsergebnisse in den Suchmaschinen sollte ein H1 tag vorhanden sein, der das Keyword enthält.

source: For good rankings there should be 1 up to 2 H2 tag containing the Keyword.
de_de: Für gute Platzierungsergebnisse in den Suchmaschinen sollten ein bis zwei H2 tags vorhanden sein, die das Keyword enthalten.

source: For good rankings there should be at least 1 up to 3 H3 tag containing the Keyword.
de_de: Für gute Platzierungsergebnisse in den Suchmaschinen sollten mindestens ein bis 3 H3 tags vorhanden sein, die das Keyword enthalten.

source: Search engines take highlighted words for more important. That’s why you should at least once use your keyword in bold.
de_de: Suchmaschinen bewerten hervorgehobene Wörter als wichtig. Deswegen sollte das Keyword mindestens einmal in bold/fett erscheinen.

source: Search engines take highlighted words for more important. That’s why you should at least once italicize your keyword .
de_de: Suchmaschinen bewerten hervorgehobene Wörter als wichtig. Deswegen sollte das Keyword mindestens einmal in kursiv erscheinen.

source: Search engines take highlighted words for more important. That’s why you should at least once underline your keyword.
de_de: Suchmaschinen bewerten hervorgehobene Wörter als wichtig. Deswegen sollte das Keyword mindestens einmal unterstrichen erscheinen.

source: It is good to have an image on your page. Use the alt tag of the image to place your keyword for search engines.
de_de: Es ist gut, ein Bild im Beitrag zu verwenden. Nutzen Sie den alt tag des Bildes, um das Keyword für Suchmaschinen zu hinterlegen.

source: Please fill your post title and write something in the content area
de_de: Bitte den Title des Beitrages angeben und den Inhaltsbereich befüllen

source: Please write something in the contentarea
de_de: Bitte den Inhaltsbereich befüllen.

source: Please fill your post title
de_de: Bitte den Title des Beitrages angeben

source: You may optimize up to <strong>3 Keywords</strong>
de_de: Sie können den Beitrag auf bis zu <strong>3 Keywords</strong> optimieren

source: Click on "+" to add Keyword
de_de: Auf "+" klicken, um ein Keyword hinzuzufügen

source: remove
de_de: entfernen

source: Add keyword...
de_de: Keyword hinzufügen

source: Click to Refresh Keywords
de_de: Zum Aktualisieren klicken

source: Click to Refresh
de_de: Klicken zum Aktualisieren

source: General
de_de: Allgemeine

source: post optimisation
de_de: Beitragsoptimierung

source: Your post ist perfectly optimized
de_de: Der Beitrag ist komplett optimiert

source: Total score
de_de: Gesamtpunkte

source: Try to get a score near 100%. If you get a green checkmark on each criteria, you have the best chances to get to 100%.
de_de: Versuchen Sie, einen Wert annähernd 100% zu erreichen. Sobald Sie ein grünes Häkchen für jedes Kriterium erhalten, haben Sie die besten Chancen, 100 % zu erreichen.

source: Score
de_de: Punkte

source: A keyword Density of 3 % is ideal – that means if your text has a length of 250 words, your defined keyword should appear 9 times.
de_de: Eine Keyword Dichte von 3 % ist optimal. Das bedeutet, dass bei einer Textlänge von 250 Wörtern das definierte Keyword 9x erscheinen sollte.

source: Keyword Density
de_de: Keyword Dichte
